### 01. Groupby입니다 ^^ - 조금 어렵습니다 ㅠㅠ

뉴욕 airBnB : https://www.kaggle.com/ptoscano230382/air-bnb-ny-2019

In [1]:
# Q1. 데이터를 로드한 뒤 상위 5개 컬럼을 출력해보자.

In [14]:
import pandas as pd
air_df = pd.read_csv('./AB_NYC_2019.csv')
air_df.head(5)

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0

In [15]:
# Q2. 각 host_name의 빈도수를 구하고 host_name으로 정렬하여 상위 5개를 출력해보자. - groupby, value_counts()

In [22]:
# 1. value_counts()를 통한 정답
air_df.host_name.value_counts().sort_index() # Value_counts()

#NAME?                      1
'Cil                        1
(Ari) HENRY LEE             1
(Email hidden by Airbnb)    6
(Mary) Haiy                 1
                           ..
단비                          1
빈나                          1
소정                          2
진                           1
현선                          1
Name: host_name, Length: 11452, dtype: int64

In [ ]:
# 2. groupby().size()라는 함수를 통해서 풀 수 있다.

In [28]:
# count()는 전체 df의 빈도수를 세어줌 - 2차원
air_df.groupby(by='host_name').count()

# size()는 전체 df의 빈도수를 세어줌 - 1차원
air_df.groupby(by='host_name').size()

host_name
#NAME?                      1
'Cil                        1
(Ari) HENRY LEE             1
(Email hidden by Airbnb)    6
(Mary) Haiy                 1
                           ..
단비                          1
빈나                          1
소정                          2
진                           1
현선                          1
Length: 11452, dtype: int64

In [4]:
# Q3. 데이터의 각 host_name의 빈도수를 구하고, 
# 빈도수 기준 내림차순 정렬한 데이터 프레임을 생성해보자.
# 빈도수 컬럼의 컬럼명은 counts로 변경해보자.(host_name은 index입니당 ^^;)

||counts|
|---|---|
|host_name||
|Michael|417|
|David|403|
|Sonder (NYC)|327|
|John|294|
|Alex|279|

In [38]:
# 1번째 방법-value_counts()를 활용하는 방법
# 긴 코드
pd.DataFrame(air_df.host_name.value_counts()).rename(columns={'host_name':'counts'})

                   counts
Michael               417
David                 403
Sonder (NYC)          327
John                  294
Alex                  279
...                   ...
Rhonycs                 1
Brandy-Courtney         1
Shanthony               1
Aurore And Jamila       1
Ilgar & Aysel           1

[11452 rows x 1 columns]

In [45]:
# 1번째 방법을 조건별로 잘라서 만들어보자.
air_freq_sr = air_df.host_name.value_counts()

# df생성해보기
air_freq_df = pd.DataFrame(air_freq_sr)

# df의 컬럼명을 counts로 변경 -> rename함수를 활용
air_freq_df.rename(columns={'host_name':'counts'}, inplace=True)

In [65]:
# 2번째 방법 - Groupby() 짧은 코드 여러개.
freq_air2 = air_df.groupby(by='host_name').size()

# df변경
freq_air_df2 = freq_air2.to_frame()

# df의 컬럼명 변경
new_freq_df2 = freq_air_df2.rename(columns={0:'counts'})

In [58]:
# 2번째 방법 - Groupby() :: index 명을 지우지 않는다... 
air_df.groupby(by='host_name').size().to_frame().rename(columns={0:'counts'}).sort_values(by='counts',ascending=False)

              counts
host_name
Michael          417
David            403
Sonder (NYC)     327
John             294
Alex             279
...              ...
Jerbean            1
Jerald             1
Jeonghoon          1
Jeny               1
현선                 1

[11452 rows x 1 columns]

In [5]:
# Q4. neighbourhood_group값에 따른 neighbourhood컬럼 값의 갯수를 구해보세요.

|neighbourhood_group|neighbourhood|size|
|---|---|---|
|Bronx|Allerton|42|
|Bronx|Baychester|7|
|Bronx|Belmont|24|
|Bronx|Bronxdale|19|

In [74]:
# 1. value_counts()
air_df[['neighbourhood_group','neighbourhood']].value_counts().sort_index()

neighbourhood_group  neighbourhood
Bronx                Allerton         42
                     Baychester        7
                     Belmont          24
                     Bronxdale        19
                     Castle Hill       9
                                      ..
Staten Island        Tottenville       7
                     West Brighton    18
                     Westerleigh       2
                     Willowbrook       1
                     Woodrow           1
Length: 221, dtype: int64

In [72]:
# 2. groupby()
air_df.groupby(['neighbourhood_group','neighbourhood']).size().sort_values(ascending=False)

neighbourhood_group  neighbourhood
Brooklyn             Williamsburg          3920
                     Bedford-Stuyvesant    3714
Manhattan            Harlem                2658
Brooklyn             Bushwick              2465
Manhattan            Upper West Side       1971
                                           ...
Staten Island        Richmondtown             1
                     New Dorp                 1
                     Fort Wadsworth           1
                     Willowbrook              1
                     Woodrow                  1
Length: 221, dtype: int64

In [6]:
# Q5. neighbourhood_group값에 따른 reviews_per_month 값의 평균, 분산, 최대, 최소값을 구해보자- agg함수 활용

In [79]:
air_df[['neighbourhood_group','reviews_per_month']].groupby('neighbourhood_group').agg(['mean','var','max','min'])

                    reviews_per_month
                                 mean       var    max   min
neighbourhood_group
Bronx                        1.837831  2.799878  10.34  0.02
Brooklyn                     1.283212  2.299040  14.00  0.01
Manhattan                    1.272131  2.651206  58.50  0.01
Queens                       1.941200  4.897848  20.94  0.01
Staten Island                1.872580  2.840895  10.12  0.02

In [7]:
# Q6. neighbourhood_group값과 neighbourhood값에 따른 price의 평균을 구해보자.

In [86]:
air_df.groupby(['neighbourhood_group','neighbourhood']).price.mean()

neighbourhood_group  neighbourhood
Bronx                Allerton          87.595238
                     Baychester        75.428571
                     Belmont           77.125000
                     Bronxdale         57.105263
                     Castle Hill       63.000000
                                         ...
Staten Island        Tottenville      144.857143
                     West Brighton     80.555556
                     Westerleigh       71.500000
                     Willowbrook      249.000000
                     Woodrow          700.000000
Name: price, Length: 221, dtype: float64

### 02. Apply_lambda

카드이용데이터 : https://www.kaggle.com/sakshigoyal7/credit-card-customers

In [8]:
# Q1. 데이터를 로드하고, 데이터의 정보를 확인해보세요.

In [90]:
card_df = pd.read_csv('./BankChurners/BankChurners.csv')
card_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10127 entries, 0 to 10126
Data columns (total 23 columns):
 #   Column                                                                                                                              Non-Null Count  Dtype
---  ------                                                                                                                              --------------  -----
 0   CLIENTNUM                                                                                                                           10127 non-null  int64
 1   Attrition_Flag                                                                                                                      10127 non-null  object
 2   Customer_Age                                                                                                                        10127 non-null  int64
 3   Gender                                                                                                                              10127 non-null  object
 4   Dependent_count                                                                                                                     10127 non-null  int64
 5   Education_Level                                                                                                                     10127 non-null  object
 6   Marital_Status                                                                                                                      10127 non-null  object
 7   Income_Category                                                                                                                     10127 non-null  object
 8   Card_Category                                                                                                                       10127 non-null  object
 9   Months_on_book                                                                                                                      10127 non-null  int64
 10  Total_Relationship_Count                                                                                                            10127 non-null  int64
 11  Months_Inactive_12_mon                                                                                                              10127 non-null  int64
 12  Contacts_Count_12_mon                                                                                                               10127 non-null  int64
 13  Credit_Limit                                                                                                                        10127 non-null  float64
 14  Total_Revolving_Bal                                                                                                                 10127 non-null  int64
 15  Avg_Open_To_Buy                                                                                                                     10127 non-null  float64
 16  Total_Amt_Chng_Q4_Q1                                                                                                                10127 non-null  float64
 17  Total_Trans_Amt                                                                                                                     10127 non-null  int64
 18  Total_Trans_Ct                                                                                                                      10127 non-null  int64
 19  Total_Ct_Chng_Q4_Q1                                                                                                                 10127 non-null  float64
 20  Avg_Utilization_Ratio                                                                                                               10127 non-null  float64
 21  Naive_Bayes_Classifier_Attrition_Flag_Card_Category_Contacts_Count_12_mon_Dependent_count_Education_Level_Months_Inactive_12_mon_1  10127 non-null  float64
 22  Naive_Bayes_Classifier_Attrition_Flag_Card_Category_Contacts_Count_12_mon_Dependent_count_Education_Level_Months_Inactive_12_mon_2  10127 non-null  float64
dtypes: float64(7), int64(10), object(6)
memory usage: 1.8+ MB

In [91]:
card_df.columns

Index(['CLIENTNUM', 'Attrition_Flag', 'Customer_Age', 'Gender',
       'Dependent_count', 'Education_Level', 'Marital_Status',
       'Income_Category', 'Card_Category', 'Months_on_book',
       'Total_Relationship_Count', 'Months_Inactive_12_mon',
       'Contacts_Count_12_mon', 'Credit_Limit', 'Total_Revolving_Bal',
       'Avg_Open_To_Buy', 'Total_Amt_Chng_Q4_Q1', 'Total_Trans_Amt',
       'Total_Trans_Ct', 'Total_Ct_Chng_Q4_Q1', 'Avg_Utilization_Ratio',
       'Naive_Bayes_Classifier_Attrition_Flag_Card_Category_Contacts_Count_12_mon_Dependent_count_Education_Level_Months_Inactive_12_mon_1',
       'Naive_Bayes_Classifier_Attrition_Flag_Card_Category_Contacts_Count_12_mon_Dependent_count_Education_Level_Months_Inactive_12_mon_2'],
      dtype='object')

In [ ]:
# Q2. Income_Category의 카테고리를 다음과 같이 변경하여 newIncome 컬럼에 넣어주세요 ^^ 
# map함수를 활용하셔도, apply를 활용하셔도 상관없습니다 ^^

Unknown : N
Less than $40K : a
$40K - $60K : b
$60K - $80K : c
$80K - $120K : d
$120K +’ : e

In [95]:
# 1번 문제풀이

cond1 = {
    'Unknown'        : 'N',
    'Less than $40K' : 'a',
    '$40K - $60K'    : 'b',
    '$60K - $80K'    : 'c',
    '$80K - $120K'   : 'd',
    '$120K +'        : 'e'   
}

In [96]:
card_df['newIncome'] = card_df.Income_Category.map(cond1)

0        c
1        a
2        d
3        a
4        c
        ..
10122    b
10123    b
10124    a
10125    b
10126    a
Name: Income_Category, Length: 10127, dtype: object

In [99]:
# 2번 문제풀이

def get_income_cat(df):
    char=''
    if df== 'Unknown': char= 'N',
    elif df== 'Less than $40K' :char= 'a'
    elif df== '$40K - $60K'    :char= 'b'
    elif df== '$60K - $80K'    :char= 'c'
    elif df== '$80K - $120K'   :char= 'd'
    elif df== '$120K +'        :char= 'e'
        
    return char

card_df.Income_Category.apply(lambda x: get_income_cat(x))

0        c
1        a
2        d
3        a
4        c
        ..
10122    b
10123    b
10124    a
10125    b
10126    a
Name: Income_Category, Length: 10127, dtype: object

In [9]:
# Q3. Customer_Age의 값을 이용하여 나이 구간을 Age_cat이라는 새 컬럼을 만들어주세요. (0~9:0, 10~19:10,
# 20~29:20...) 각 구간의 빈도수를 출력하라.

In [102]:
# 1번 문제풀이
card_df.Customer_Age.max()

73

In [103]:
def get_income_cat(df):
    result=int()
    if df < 10: result= 0
    elif df <20:result= 10
    elif df <30:result= 20
    elif df <40:result= 30
    elif df <50:result= 40
    elif df <60:result= 50
    elif df <70:result= 60
    elif df <80:result= 70
        
    return result

In [105]:
card_df.Customer_Age.apply(lambda x: get_income_cat(x)).value_counts()

40    4561
50    2998
30    1841
60     530
20     195
70       2
Name: Customer_Age, dtype: int64

In [ ]:
#2번 문제풀이

df['AgeState']  = df.Customer_Age.map(lambda x: x//10 *10)

Ans = df['AgeState'].value_counts().sort_index()

In [10]:
# Q4. Education_Level의 값에서 Graduate이 포함된 경우에는 1 그렇지 않다면 0으로 변경하여
# new_edu_level 컬럼을 정의하고 빈도수를 출력해보세요.

In [108]:
card_df['new_edu_level'] = card_df.Education_Level.map(lambda x : 1 if 'Graduate' in x else 0)
Ans = card_df['new_edu_level'].value_counts()

In [109]:
# Q5. Marital_Status 컬럼값이 Married이고 Card_Category 컬럼의 값이 Platinum인 경우 1 그렇지 
# 않은 경우에는 모두 0으로 정의해주세요...

# 그리고 그 결과를 new_status 컬럼에 넣어주세요.

In [112]:
def get_status(x):
    if x.Marital_Status =='Married' and x.Card_Category =='Platinum':
        return 1
    else:
        return 0


card_df['newState'] = card_df.apply(get_status,axis=1)

card_df['newState'].value_counts()

0    10120
1        7
Name: newState, dtype: int64